** Intro

# Mención a la programación

En la escuela (facultad) se enseña programación desde nada más entrar
al grado. Forma parte de una rama fundamental de la informática, y la
forma que tenemos de programar es mediante lenguajes de
programación. El estudio de estos es tan extenso que el departamento
más grande de la facultad es el Departamento de Lenguajes.

# Clasificación de los lenguajes

Todo este estudio ha provocado una necesaria estructuración o
clasificación de los lenguajes. Uno de los primeros aspectos que
miramos de un lenguaje es saber qué podemos hacer con él, ¿para qué
nos va a servir? ¿Qué vamos a poder programar?

No es lo mismo si queremos programar una página web, un servidor,
hacer inteligencia artificial, consultas a bases de datos o scripts de
mantenimiento. Al final la mayoría de estos lenguajes son equivalentes
en cuanto a que con mayor o menor esfuerzo (gracias a librerías o
integración) podremos llegar al mismo resultado

Sin embargo, hay otros aspectos en los que no nos solemos fijar tanto
a la hora de elegir un lenguaje. El diseño del lenguaje nos condiciona
respecto a lo que podemos expresar con él. La sintaxis es de lo primero
que aprendemos de un lenguaje, e incluso aquí podemos encontrar
diferencias entre lo que ofrecen unos y otros lenguajes. Por ejemplo,
en qué lenguajes podemos escribir esto:

#+BEGIN_SRC python :results output
print(1 < 2 < 3)
print(1 < 2 and 2 < 3)
#+END_SRC

#+RESULTS:
: True
: True

Estos dos programas son equivalentes, nos permiten computar lo mismo
de diferentes maneras. Concretamente esta sintaxis no debería
decantarnos por elegir un lenguaje u otro, pero otras caracterísitcas
del diseño sí que van a ser cruciales para los pogramas que escribamos.

Lo que veremos hoy no van a ser decisiones de diseño de azúcar
sintáctico que nos van a ahorrar unos caracteres. Hoy vamos a ver
características del lenguaje que nos van a permitir razonar si los
programas que estamos escribiendo son correctos.

